Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Weblate has two month release cycle for releases (x.y). These are usually followed by a bunch of bugfix releases to fix issues which slip into them (x.y.z). This includes bug fixes and addressing security issues.
sv: Weblate har en tvÃ¥mÃ¥naderscykel fÃ¶r releaser (x.y). Dessa fÃ¶ljs vanligtvis av en rad buggfix-releaser fÃ¶r att Ã¥tgÃ¤rda problem som smugit sig in i dem (x.y.z). Detta inkluderar buggfixar och Ã¥tgÃ¤rdande av sÃ¤kerhetsproblem.

source: The change in the major version indicates that the upgrade process can not skip this version - you always have to upgrade to x.0 before upgrading to higher x.y releases.
sv: Ãndringen i huvudversionen indikerar att uppgraderingsprocessen inte kan hoppa Ã¶ver denna version â du mÃ¥ste alltid uppgradera till x.0 innan du uppgraderar till hÃ¶gre x.y-versioner.

source: The Docker container includes additional digit in versioning to track changes in the container itself like dependencies. These updates may include security updates.
sv: Docker-containern innehÃ¥ller ytterligare siffror i versionsnumreringen fÃ¶r att spÃ¥ra Ã¤ndringar i sjÃ¤lva containern, till exempel beroenden. Dessa uppdateringar kan inkludera sÃ¤kerhetsuppdateringar.

source: Release planning
sv: Releaseplanering

source: The features for upcoming releases are collected using GitHub milestones, you can see our roadmap at <https://github.com/WeblateOrg/weblate/milestones>.
sv: Funktionerna fÃ¶r kommande versioner samlas in med hjÃ¤lp av GitHub-milstolpar. Du kan se vÃ¥r roadmap pÃ¥ <https://github.com/WeblateOrg/weblate/milestones>.

source: Release process
sv: FrigÃ¶ringsprocess

source: Things to check prior to release:
sv: Saker att kontrollera fÃ¶re release:

source: Check newly translated languages by :command:`./scripts/list-translated-languages.py`.
sv: Kontrollera nyÃ¶versatta sprÃ¥k med :command:`./scripts/list-translated-languages.py`.

source: Set final version by :command:`./scripts/prepare-release`.
sv: StÃ¤ll in slutlig version med :command:`./scripts/prepare-release`.

source: Make sure screenshots are up to date :command:`make -j 12 -C docs update-screenshots`.
sv: Se till att skÃ¤rmdumparna Ã¤r uppdaterade :command:`make -j 12 -C docs update-screenshots`.

source: Merge any possibly pending translations :command:`wlc push; git remote update; git merge origin/weblate`
sv: SlÃ¥ ihop eventuella vÃ¤ntande Ã¶versÃ¤ttningar :command:`wlc push; git remote update; git merge origin/weblate`

source: Perform the release:
sv: UtfÃ¶r frigÃ¶randet:

source: Create a release :command:`./scripts/create-release --tag` (see below for requirements).
sv: Skapa en release :command:`./scripts/create-release --tag` (se nedan fÃ¶r krav).

source: Post release manual steps:
sv: Manuella steg efter release:

source: Close GitHub milestone.
sv: StÃ¤ng GitHub-milstolpe.

source: Once the Docker image is tested, add a tag and push it.
sv: NÃ¤r Docker-bilden har testats lÃ¤gger du till en tagg och pushar den.

source: Include new version in :file:`.github/workflows/migrations.yml` to cover it in migration testing.
sv: Inkludera den nya versionen i :file:`.github/workflows/migrations.yml` fÃ¶r att tÃ¤cka den i migrationstestningen.

source: Increase version in the repository by :command:`./scripts/set-version.py`.
sv: Ãka versionen i arkivet med :command:`./scripts/set-version.py`.

source: Check that readthedocs.org did build all translations of the documentation using :command:`./scripts/rtd-projects.py`.
sv: Kontrollera att readthedocs.org har skapat alla Ã¶versÃ¤ttningar av dokumentationen med hjÃ¤lp av :command:`./scripts/rtd-projects.py`.

source: To create tags using the :command:`./scripts/create-release` script you will need following:
sv: FÃ¶r att skapa taggar med hjÃ¤lp av skriptet :command:`./scripts/create-release` behÃ¶ver du fÃ¶ljande:

source: Push access to Weblate git repositories (it pushes tags)
sv: Push-Ã¥tkomst till Weblate git-arkiv (pushar taggar)

source: Data schemas
sv: Dataskem

source: Weblate uses `JSON Schema <https://json-schema.org/>`_ to define layout of external JSON files.
sv: Weblate anvÃ¤nder `JSON Schema <https://json-schema.org/>`_ fÃ¶r att definiera layouten fÃ¶r externa JSON-filer.

source: Starting contributing code to Weblate
sv: BÃ¶rja bidra med kod till Weblate

source: Understand the Weblate source code by going through :doc:`code`, :doc:`frontend` and :doc:`internals`.
sv: FÃ¶rstÃ¥ Weblates kÃ¤llkod genom att gÃ¥ igenom :doc:`code`, :doc:`frontend` och :doc:`internals`.

source: Starting with the codebase
sv: BÃ¶rja med kodbasen

source: Familiarize yourself with the Weblate codebase, by having a go at the bugs labelled `good first issue <https://github.com/WeblateOrg/weblate/labels/good%20first%20issue>`_.
sv: Bekanta dig med Weblates kodbas genom att testa buggarna mÃ¤rkta med `good first issue <https://github.com/WeblateOrg/weblate/labels/good%20first%20issue>`_.

source: You are welcome to start working on these issues without asking. Just announce that in the issue, so that it's clear that somebody is working on that issue.
sv: Du Ã¤r vÃ¤lkommen att bÃ¶rja arbeta med dessa frÃ¥gor utan att frÃ¥ga. Meddela bara detta i frÃ¥gan, sÃ¥ att det Ã¤r tydligt att nÃ¥gon arbetar med den frÃ¥gan.

source: Running Weblate locally
sv: KÃ¶r Weblate lokalt

source: The most comfortable approach to get started with Weblate development is to follow :doc:`../admin/install/source`. It will get you a virtualenv with editable Weblate sources.
sv: Det enklaste sÃ¤ttet att komma igÃ¥ng med Weblate-utveckling Ã¤r att fÃ¶lja :doc:`../admin/install/source`. DÃ¥ fÃ¥r du en virtualenv med redigerbara Weblate-kÃ¤llor.

source: Clone the Weblate source code:
sv: Klonera Weblate-kÃ¤llkoden:

source: Create a virtualenv:
sv: Skapa en virtualenv:

source: Install Weblate (for this you need some system dependencies, see :doc:`../admin/install/source`) and all dependencies useful for development:
sv: Installera Weblate (fÃ¶r detta behÃ¶ver du vissa systemberoenden, se :doc:`../admin/install/source`) och alla beroenden som Ã¤r anvÃ¤ndbara fÃ¶r utveckling:

source: Start a development server:
sv: Starta en utvecklingsserver:

source: Depending on your configuration, you might also want to start Celery workers:
sv: Beroende pÃ¥ din konfiguration kanske du ocksÃ¥ vill starta Celery-arbetare:

source: To run a test (see :ref:`local-tests` for more details):
sv: FÃ¶r att kÃ¶ra ett test (se :ref:`local-tests` fÃ¶r mer information):

source: Running Weblate locally in Docker
sv: KÃ¶r Weblate lokalt i Docker

source: If you have Docker and the docker-compose-plugin installed, you need an additional tool called ``jq`` which you can install through your favorite package manager. Then, you can spin up the development environment by simply running:
sv: Om du har Docker och docker-compose-plugin installerat behÃ¶ver du ett extra verktyg som heter ``jq``, vilket du kan installera via din favoritpakethanterare. Sedan kan du starta utvecklingsmiljÃ¶n genom att helt enkelt kÃ¶ra:

source: It will create a development Docker image and start it. Weblate is running on <http://127.0.0.1:8080/> and you can sign in as the user ``admin`` using ``admin`` as the password. The new installation is empty, so you might want to continue with :ref:`adding-projects`.
sv: Det kommer att skapa en utvecklings-Docker-bild och starta den. Weblate kÃ¶rs pÃ¥ <http://127.0.0.1:8080/> och du kan logga in som anvÃ¤ndaren ``admin`` med ``admin`` som lÃ¶senord. Den nya installationen Ã¤r tom, sÃ¥ du kanske vill fortsÃ¤tta med :ref:`adding-projects`.

source: Weblate is configured to use :program:`maildev` container as a e-mail server. The delivered e-mails can be seen at <http://127.0.0.1:1080/>.
sv: Weblate Ã¤r konfigurerat fÃ¶r att anvÃ¤nda :program:`maildev`-containern som e-postserver. De levererade e-postmeddelandena kan ses pÃ¥ <http://127.0.0.1:1080/>.

source: The :file:`Dockerfile` and :file:`docker-compose.yml` for this are located in the :file:`dev-docker` directory. For easier access to the database during development, the container running PostgreSQL is exposed on port ``5433``.
sv: :file:`Dockerfile` och :file:`docker-compose.yml` fÃ¶r detta finns i katalogen :file:`dev-docker`. FÃ¶r att underlÃ¤tta Ã¥tkomsten till databasen under utvecklingen Ã¤r containern som kÃ¶r PostgreSQL exponerad pÃ¥ port ``5433``.

source: The script also accepts some parameters, to execute tests, run it with the ``test`` parameter and then specify any :djadmin:`django:test` parameters, for example running only tests in the ``weblate.machine`` module:
sv: Skriptet accepterar ocksÃ¥ vissa parametrar. FÃ¶r att kÃ¶ra tester, kÃ¶r det med parametern ``test`` och ange sedan valfria :djadmin:`django:test`-parametrar, till exempel fÃ¶r att endast kÃ¶ra tester i modulen ``weblate.machine``:

source: Be careful that your Docker containers are up and running before running the tests. You can check that by running the ``docker ps`` command.
sv: Se till att dina Docker-containrar Ã¤r igÃ¥ng innan du kÃ¶r testerna. Du kan kontrollera detta genom att kÃ¶ra kommandot ``docker ps``.

source: To display the logs:
sv: FÃ¶r att visa loggarna:

source: To stop the background containers, run:
sv: FÃ¶r att stoppa bakgrundscontainrarna, kÃ¶r:

source: Running the script without arguments will re-create the Docker container and restart it.
sv: Om du kÃ¶r skriptet utan argument skapas Docker-containern pÃ¥ nytt och startas om.

source: This container is not suitable for production use. Security is sacrificed to make the development easier.
sv: Denna container Ã¤r inte lÃ¤mplig fÃ¶r produktionsanvÃ¤ndning. SÃ¤kerheten har offrats fÃ¶r att underlÃ¤tta utvecklingen.

source: Bootstrapping your devel instance
sv: Bootstrappa din utvecklingsinstans

source: You might want to use :wladmin:`import_demo` to create demo translations and :wladmin:`createadmin` to make an admin user.
sv: Du kan anvÃ¤nda :wladmin:`import_demo` fÃ¶r att skapa demÃ¶versÃ¤ttningar och :wladmin:`createadmin` fÃ¶r att skapa en administratÃ¶rsanvÃ¤ndare.

source: If you have :ref:`billing` installed as well, you can use :wladmin:`billing_demo` to create a demo billing project.
sv: Om du ocksÃ¥ har :ref:`billing` installerat kan du anvÃ¤nda :wladmin:`billing_demo` fÃ¶r att skapa ett demo-faktureringsprojekt.

source: Coding Weblate with PyCharm
sv: Kodning av Weblate med PyCharm

source: PyCharm is a known IDE for Python, here are some guidelines to help you set up your Weblate project in it.
sv: PyCharm Ã¤r en vÃ¤lkÃ¤nd IDE fÃ¶r Python. HÃ¤r Ã¤r nÃ¥gra riktlinjer som hjÃ¤lper dig att konfigurera ditt Weblate-projekt i den.

source: Considering you have just cloned the GitHub repository to a folder, just open it with PyCharm. Once the IDE is open, the first step is to specify the interpreter you want to use:
sv: Eftersom du just har klonat GitHub-arkivet till en mapp, Ã¶ppnar du det med PyCharm. NÃ¤r IDE Ã¤r Ã¶ppet Ã¤r det fÃ¶rsta steget att ange vilken tolk du vill anvÃ¤nda:

source: You can either choose to let PyCharm create the virtualenv for you, or select an already existing one:
sv: Du kan antingen lÃ¥ta PyCharm skapa virtualenv Ã¥t dig eller vÃ¤lja en redan befintlig:

source: Don't forget to install the dependencies once the interpreter is set: Either through the console (the console from the IDE will directly use your virtualenv by default), or through the interface when you get a warning about missing dependencies.
sv: GlÃ¶m inte att installera beroenden nÃ¤r tolken Ã¤r instÃ¤lld: Antingen via konsolen (konsolen frÃ¥n IDE anvÃ¤nder direkt din virtualenv som standard) eller via grÃ¤nssnittet nÃ¤r du fÃ¥r en varning om saknade beroenden.

source: The second step is to set the right info to use Django natively inside PyCharm: The idea is to be able to immediately trigger the unit tests in the IDE. For that you need to specify the root path of the Django project and the path to its settings:
sv: Det andra steget Ã¤r att stÃ¤lla in rÃ¤tt information fÃ¶r att kunna anvÃ¤nda Django direkt i PyCharm: Tanken Ã¤r att kunna starta enhetstesterna direkt i IDE. FÃ¶r att gÃ¶ra det mÃ¥ste du ange rotvÃ¤gen till Django-projektet och vÃ¤gen till dess instÃ¤llningar:

source: Be careful, the `Django project root` is the actual root of the repository, not the Weblate sub-directory. About the settings, you could use the :file:`weblate/settings_test.py` from the repository, but you could create your own setting and set it there.
sv: Var fÃ¶rsiktig, `Django-projektroten` Ã¤r den faktiska roten i arkivet, inte Weblate-underkatalogen. NÃ¤r det gÃ¤ller instÃ¤llningarna kan du anvÃ¤nda :file:`weblate/settings_test.py` frÃ¥n arkivet, men du kan ocksÃ¥ skapa dina egna instÃ¤llningar och ange dem dÃ¤r.

source: The last step is to run the server and to put breakpoints in the code to be able to debug it. This is done by creating a new `Django Server` configuration:
sv: Det sista steget Ã¤r att kÃ¶ra servern och sÃ¤tta in brytpunkter i koden fÃ¶r att kunna felsÃ¶ka den. Detta gÃ¶rs genom att skapa en ny `Django Server`-konfiguration:

source: Be careful with the property called :guilabel:`No reload`: It prevents the server from being reloaded live if you modify files. This allows the existing debugger breakpoints to persist, when they normally would be discarded upon reloading the server.
sv: Var fÃ¶rsiktig med egenskapen :guilabel:`No reload`: Den fÃ¶rhindrar att servern laddas om live om du modifierar filer. Detta gÃ¶r att befintliga brytpunkter i felsÃ¶karen kvarstÃ¥r, nÃ¤r de normalt skulle kasseras vid omladdning av servern.

source: Weblate testsuite and continuous integration
sv: Weblate testsuite och kontinuerlig integration

source: Testsuites exist for most of the current code, increase coverage by adding testcases for any new functionality, and verify that it works.
sv: Testsuiter finns fÃ¶r stÃ¶rre delen av den nuvarande koden. Ãka tÃ¤ckningen genom att lÃ¤gga till testfall fÃ¶r alla nya funktioner och verifiera att de fungerar.

source: Continuous integration
sv: Kontinuerlig integration

source: Weblate relies on `GitHub Actions`_ to run tests, build documentation, code linting, and other tasks to ensure code quality.
sv: Weblate anvÃ¤nder `GitHub Actions`_ fÃ¶r att kÃ¶ra tester, skapa dokumentation, kodgranska och utfÃ¶ra andra uppgifter fÃ¶r att sÃ¤kerstÃ¤lla kodkvaliteten.

source: `Codecov`_ collects the code coverage information from the tests that were run.
sv: `Codecov`_ samlar in information om kodtÃ¤ckning frÃ¥n de tester som har kÃ¶rts.

source: There are several jobs to verify different aspects:
sv: Det finns flera uppgifter fÃ¶r att verifiera olika aspekter:

source: Unit and functional tests using `pytest <https://pytest.org/>`_.
sv: Enhets- och funktionstester med hjÃ¤lp av `pytest <https://pytest.org/>`_.

source: Documentation build and external links using `Sphinx <https://www.sphinx-doc.org/>`_.
sv: Dokumentation och externa lÃ¤nkar med hjÃ¤lp av `Sphinx <https://www.sphinx-doc.org/>`_.

source: Code linting and quality assurance using `ruff <https://docs.astral.sh/ruff/>`_ and `pylint <https://www.pylint.org/>`_.
sv: Kodgranskning och kvalitetssÃ¤kring med hjÃ¤lp av `ruff <https://docs.astral.sh/ruff/>`_ och `pylint <https://www.pylint.org/>`_.

source: Code security scanning using `CodeQL <https://codeql.github.com/>`_.
sv: KodsÃ¤kerhetsskanning med hjÃ¤lp av `CodeQL <https://codeql.github.com/>`_.

source: Code formatting using `pre-commit <https://pre-commit.com/>`_.
sv: Kodformatering med `pre-commit <https://pre-commit.com/>`_.

source: Migration testing from all supported releases
sv: Migreringstestning frÃ¥n alla versioner som stÃ¶ds

source: Setup verification (ensures that generated dist files do not miss anything and can be tested)
sv: Verifiering av instÃ¤llningar (sÃ¤kerstÃ¤ller att genererade dist-filer inte saknar nÃ¥got och kan testas)

source: The configuration for the CI is in :file:`.github/workflows` directory. It heavily uses helper scripts stored in :file:`ci` directory. The scripts can be also executed manually, but they require several environment variables, mostly defining Django settings file to use and test database connection. The example definition of that is in :file:`scripts/test-database.sh`:
sv: Konfigurationen fÃ¶r CI finns i katalogen :file:`.github/workflows`. Den anvÃ¤nder i stor utstrÃ¤ckning hjÃ¤lpscript som finns lagrade i katalogen :file:`ci`. Scripten kan ocksÃ¥ kÃ¶ras manuellt, men de krÃ¤ver flera miljÃ¶variabler, frÃ¤mst fÃ¶r att definiera vilken Django-instÃ¤llningsfil som ska anvÃ¤ndas och testa databasanslutningen. Ett exempel pÃ¥ en sÃ¥dan definition finns i :file:`scripts/test-database.sh`:

source: The simple execution can look like:
sv: Det enkla utfÃ¶randet kan se ut sÃ¥ hÃ¤r:

source: Local testing of Weblate
sv: Lokal testning av Weblate

source: Before running test, please ensure test dependencies are installed. This can be done by ``pip install -e .[test]``.
sv: Innan du kÃ¶r testet, se till att testberoenden Ã¤r installerade. Detta kan gÃ¶ras med ``pip install -e .[test]``.

source: Testing using pytest
sv: Testning med pytest

source: Prior to running tests you should collect static files as some tests rely on them being present:
sv: Innan du kÃ¶r tester bÃ¶r du samla in statiska filer, eftersom vissa tester Ã¤r beroende av att de finns tillgÃ¤ngliga:

source: You can use `pytest` to run a testsuite locally:
sv: Du kan anvÃ¤nda `pytest` fÃ¶r att kÃ¶ra en testserie lokalt:

source: Running an individual test file:
sv: KÃ¶rning av en enskild testfil:

source: You will need a database (PostgreSQL) server to be used for tests. By default Django creates separate database to run tests with ``test_`` prefix, so in case your settings is configured to use ``weblate``, the tests will use ``test_weblate`` database. See :ref:`database-setup` for setup instructions.
sv: Du behÃ¶ver en databas (PostgreSQL) server fÃ¶r att kunna utfÃ¶ra tester. Som standard skapar Django en separat databas fÃ¶r att kÃ¶ra tester med prefixet ``test_``, sÃ¥ om dina instÃ¤llningar Ã¤r konfigurerade fÃ¶r att anvÃ¤nda ``weblate``, kommer testerna att anvÃ¤nda databasen ``test_weblate``. Se :ref:`database-setup` fÃ¶r installationsinstruktioner.

source: The :file:`weblate/settings_test.py` is used in CI environment as well (see :ref:`ci-tests`) and can be tuned using environment variables:
sv: :file:`weblate/settings_test.py` anvÃ¤nds Ã¤ven i CI-miljÃ¶n (se :ref:`ci-tests`) och kan justeras med hjÃ¤lp av miljÃ¶variabler:

source: The tests can also be executed inside developer docker container, see :ref:`dev-docker`.
sv: Testerna kan ocksÃ¥ kÃ¶ras inuti utvecklarens docker-container, se :ref:`dev-docker`.

source: See :doc:`django:topics/testing/index` for more info on running and writing tests for Django.
sv: Se :doc:`django:topics/testing/index` fÃ¶r mer information om hur man kÃ¶r och skriver tester fÃ¶r Django.

source: Local testing of Weblate modules
sv: Lokal testning av Weblate-moduler

source: The tests are executed using :program:`py.test`. First you need to install test requirements:
sv: Testerna kÃ¶rs med hjÃ¤lp av :program:`py.test`. FÃ¶rst mÃ¥ste du installera testkraven:

source: You can then execute the testsuite in the repository checkout:
sv: Du kan sedan kÃ¶ra testsuiten i arkivets utcheckning:

source: Testing repository
sv: Testarkiv

source: Many of the tests in the Weblate test suite use the test repository. The test suite repository is maintained at https://github.com/WeblateOrg/test. The script :file:`scripts/pack-test-data.sh` is then used to generate a tarball with a repository for each of the supported version control systems. These are stored as :file:`weblate/trans/tests/data/test-base-repo.git.tar`, :file:`weblate/trans/tests/data/test-base-repo.hg.tar`, and :file:`weblate/trans/tests/data/test-base-repo.svn.tar` in the Weblate repository.
sv: MÃ¥nga av testerna i Weblate-testpaketet anvÃ¤nder testarkivet. Testpaketets arkiv underhÃ¥lls pÃ¥ https://github.com/WeblateOrg/test. Skriptet :file:`scripts/pack-test-data.sh` anvÃ¤nds sedan fÃ¶r att generera en tarball med ett arkiv fÃ¶r vart och ett av de versionkontrollsystem som stÃ¶ds. Dessa lagras som :file:`weblate/trans/tests/data/test-base-repo.git.tar`, :file:`weblate/trans/tests/data/test-base-repo.hg.tar` och :file:`weblate/trans/tests/data/test-base-repo.svn.tar` i Weblate-arkivet.

source: The https://github.com/WeblateOrg/test repository is tagged at the release time, which ensures that the release tags can be used to access test data used at the release time. The script tries to create reproducible tarballs as much as possible.
sv: Arkivet https://github.com/WeblateOrg/test taggas vid release-tidpunkten, vilket sÃ¤kerstÃ¤ller att releasetaggarna kan anvÃ¤ndas fÃ¶r att komma Ã¥t testdata som anvÃ¤ndes vid release-tidpunkten. Skriptet fÃ¶rsÃ¶ker skapa reproducerbara tarbollar i sÃ¥ stor utstrÃ¤ckning som mÃ¶jligt.

source: Weblate Trademark Guidelines
sv: Weblate varumÃ¤rkesriktlinjer

source: Weblate is an open-source organization. Because we make privacy-respecting localization tools and provide it as copylefted libre software, proper use of our trademarks is essential to inform users whether Weblate stands behind a product or service so that we can continue to develop. The Weblate name is not only a trademark used to identify our technology, components and services, it also serves as our company name. When using Weblate trademarks (including some product names that are part of our organization) you must comply with these Weblate Trademark Guidelines.
sv: Weblate Ã¤r en organisation med Ã¶ppen kÃ¤llkod. Eftersom vi tillverkar lokaliseringsverktyg som respekterar integriteten och tillhandahÃ¥ller dem som copyleft-fri programvara, Ã¤r korrekt anvÃ¤ndning av vÃ¥ra varumÃ¤rken avgÃ¶rande fÃ¶r att informera anvÃ¤ndarna om Weblate stÃ¥r bakom en produkt eller tjÃ¤nst, sÃ¥ att vi kan fortsÃ¤tta att utvecklas. Namnet Weblate Ã¤r inte bara ett varumÃ¤rke som anvÃ¤nds fÃ¶r att identifiera vÃ¥r teknik, vÃ¥ra komponenter och tjÃ¤nster, utan fungerar ocksÃ¥ som vÃ¥rt fÃ¶retagsnamn. NÃ¤r du anvÃ¤nder Weblates varumÃ¤rken (inklusive vissa produktnamn som ingÃ¥r i vÃ¥r organisation) mÃ¥ste du fÃ¶lja dessa riktlinjer fÃ¶r Weblates varumÃ¤rken.

source: Some of our trademarks include:
sv: NÃ¥gra av vÃ¥ra varumÃ¤rken Ã¤r:

source: However, this is not a complete list of our names, logos, and brand features, all of which are subject to these guidelines.
sv: Detta Ã¤r dock inte en fullstÃ¤ndig lista Ã¶ver vÃ¥ra namn, logotyper och varumÃ¤rkesegenskaper, som alla omfattas av dessa riktlinjer.

source: When do I need specific permission to use a Weblate trademark?
sv: NÃ¤r behÃ¶ver jag sÃ¤rskilt tillstÃ¥nd fÃ¶r att anvÃ¤nda ett Weblate-varumÃ¤rke?

source: Since Weblate is a provider of a software that can be used in many versions â hosted, dedicated cloud and self-hosted (both paid and free), it is important to distinguish between these cases. Each version has a specific way of using the Weblate trademark. However, in all cases it is not necessary to receive permission directly from Weblate (or its affiliates) to:
sv: Eftersom Weblate Ã¤r en leverantÃ¶r av programvara som kan anvÃ¤ndas i mÃ¥nga versioner â hostad, dedikerad molnbaserad och sjÃ¤lvhostad (bÃ¥de betald och gratis) â Ã¤r det viktigt att skilja mellan dessa fall. Varje version har ett specifikt sÃ¤tt att anvÃ¤nda Weblate-varumÃ¤rket. I alla fall Ã¤r det dock inte nÃ¶dvÃ¤ndigt att fÃ¥ tillstÃ¥nd direkt frÃ¥n Weblate (eller dess dotterbolag) fÃ¶r att:

source: Use Weblate wordmarks and/or logos in unmodified versions of Weblate programs, products, services and technologies.
sv: AnvÃ¤nd Weblate-ordmÃ¤rken och/eller logotyper i ofÃ¶rÃ¤ndrade versioner av Weblate-program, produkter, tjÃ¤nster och teknik.
